# Auto Insurance Data Cleaning

Data is currently stored in 4 separate CSV files and needs to be compiled into one. The end goal is to use the data with both BI software to create a dashboard as well as creating a model to make predictions, so transformations done should keep the data in a form that is flexible enough for both applications.

In [4]:
# Imports
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

## Load in Data

In [2]:
# Read in address.csv as a dataframe
address_df = pd.read_csv('Data/address.csv')

address_df.head(10)

,ADDRESS_ID,LATITUDE,LONGITUDE,STREET_ADDRESS,CITY,STATE,COUNTY
0,5.213011e+11,32.315803,-96.627896,8457 Wright Mountains Apt. 377,Ennis,TX,Ellis
1,5.213000e+11,NaN,NaN,082 Cline Mountains Apt. 353,Irving,TX,Dallas
2,5.213002e+11,32.806290,-96.779857,457 John Mills,Dallas,TX,Dallas
3,5.213013e+11,32.825737,-96.939687,5726 Barnett Meadow,Irving,TX,Dallas
4,5.213010e+11,32.867192,-96.715552,050 Nicholas Views,Dallas,TX,Dallas
5,5.213015e+11,33.055527,-96.705288,207 Rebecca Brook,Plano,TX,Collin
6,5.213006e+11,33.406005,-96.966034,9983 Jesse Landing,Pilot Point,TX,Denton
7,5.213009e+11,32.892217,-97.083184,76627 Waters Estate Apt. 016,Grapevine,TX,Tarrant
8,5.213001e+11,32.858974,-96.649463,378 Anderson Manors Suite 859,Dallas,TX,Dallas
9,5.213014e+11,32.982515,-96.575038,12710 Vanessa Rest,Sachse,TX,Dallas

In [3]:
# Check information for address_df
address_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1536673 entries, 0 to 1536672
Data columns (total 7 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   ADDRESS_ID      1536673 non-null  float64
 1   LATITUDE        1406712 non-null  float64
 2   LONGITUDE       1406712 non-null  float64
 3   STREET_ADDRESS  1536673 non-null  object
 4   CITY            1521239 non-null  object
 5   STATE           1536673 non-null  object
 6   COUNTY          1521239 non-null  object
dtypes: float64(3), object(4)
memory usage: 82.1+ MB

In [7]:
# Check null values
address_df.isna().sum()

ADDRESS_ID             0
LATITUDE          129961
LONGITUDE         129961
STREET_ADDRESS         0
CITY               15434
STATE                  0
COUNTY             15434
dtype: int64

In [8]:
# Read in customer.csv as a dataframe
customer_df = pd.read_csv('Data/customer.csv')

customer_df.head(10)

,INDIVIDUAL_ID,ADDRESS_ID,CURR_ANN_AMT,DAYS_TENURE,CUST_ORIG_DATE,AGE_IN_YEARS,DATE_OF_BIRTH,SOCIAL_SECURITY_NUMBER
0,2.213000e+11,5.213000e+11,818.877997,1454.0,2018-12-09,44.474,1978-06-23,608-XX-7640
1,2.213001e+11,5.213001e+11,974.199182,1795.0,2018-01-02,72.559,1950-05-30,342-XX-6908
2,2.213007e+11,5.213002e+11,967.375112,4818.0,2009-09-23,55.444,1967-07-07,240-XX-9224
3,2.213016e+11,5.213006e+11,992.409561,130.0,2022-07-25,53.558,1969-05-25,775-XX-6249
4,2.213016e+11,5.213006e+11,784.633494,5896.0,2006-10-11,50.220,1972-09-25,629-XX-7298
5,2.213027e+11,5.213010e+11,909.916163,484.0,2021-08-05,32.641,1990-04-20,194-XX-6050
6,2.213007e+11,5.213003e+11,1084.048271,2896.0,2014-12-28,70.806,1952-02-29,653-XX-7262
7,2.213022e+11,5.213008e+11,1277.370767,4096.0,2011-09-15,45.969,1976-12-24,163-XX-1670
8,2.213029e+11,5.213011e+11,917.201036,2107.0,2017-02-24,56.389,1966-07-27,621-XX-5572
9,2.213012e+11,5.213005e+11,1095.390747,3387.0,2013-08-24,64.307,1958-08-28,793-XX-1178

In [9]:
# Check information for customer_df
customer_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2280321 entries, 0 to 2280320
Data columns (total 8 columns):
 #   Column                  Dtype
---  ------                  -----
 0   INDIVIDUAL_ID           float64
 1   ADDRESS_ID              float64
 2   CURR_ANN_AMT            float64
 3   DAYS_TENURE             float64
 4   CUST_ORIG_DATE          object
 5   AGE_IN_YEARS            float64
 6   DATE_OF_BIRTH           object
 7   SOCIAL_SECURITY_NUMBER  object
dtypes: float64(5), object(3)
memory usage: 139.2+ MB

In [10]:
# Check null values
customer_df.isna().sum()

INDIVIDUAL_ID                  1
ADDRESS_ID                     1
CURR_ANN_AMT                   0
DAYS_TENURE                    0
CUST_ORIG_DATE                 0
AGE_IN_YEARS              167766
DATE_OF_BIRTH                  0
SOCIAL_SECURITY_NUMBER         0
dtype: int64

In [11]:
# Read in demographic.csv as a dataframe
demographic_df = pd.read_csv('Data/demographic.csv')

demographic_df.head(10)

,INDIVIDUAL_ID,INCOME,HAS_CHILDREN,LENGTH_OF_RESIDENCE,MARITAL_STATUS,HOME_MARKET_VALUE,HOME_OWNER,COLLEGE_DEGREE,GOOD_CREDIT
0,2.213028e+11,125000.000,1.0,8.0,Single,300000 - 349999,1,1,1
1,2.213032e+11,42500.000,0.0,0.0,Single,NaN,0,0,0
2,2.213032e+11,27500.000,0.0,15.0,Married,75000 - 99999,1,0,1
3,2.213032e+11,80372.176,0.0,0.0,NaN,1000 - 24999,1,0,0
4,2.213032e+11,125000.000,0.0,0.0,NaN,NaN,0,0,1
5,2.213031e+11,70000.000,1.0,14.0,Married,100000 - 124999,1,0,1
6,2.213031e+11,87500.000,1.0,3.0,Single,75000 - 99999,1,0,1
7,2.213031e+11,62500.000,1.0,5.0,Married,50000 - 74999,1,0,1
8,2.213032e+11,125000.000,0.0,3.0,Married,75000 - 99999,1,1,1
9,2.213032e+11,42500.000,1.0,5.0,NaN,75000 - 99999,0,1,1

In [12]:
# Check information for demographic_df
demographic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2112579 entries, 0 to 2112578
Data columns (total 9 columns):
 #   Column               Dtype
---  ------               -----
 0   INDIVIDUAL_ID        float64
 1   INCOME               float64
 2   HAS_CHILDREN         float64
 3   LENGTH_OF_RESIDENCE  float64
 4   MARITAL_STATUS       object
 5   HOME_MARKET_VALUE    object
 6   HOME_OWNER           int64
 7   COLLEGE_DEGREE       int64
 8   GOOD_CREDIT          int64
dtypes: float64(4), int64(3), object(2)
memory usage: 145.1+ MB

In [13]:
# Check null values
demographic_df.isna().sum()

INDIVIDUAL_ID               0
INCOME                      0
HAS_CHILDREN                0
LENGTH_OF_RESIDENCE         0
MARITAL_STATUS         431648
HOME_MARKET_VALUE      190205
HOME_OWNER                  0
COLLEGE_DEGREE              0
GOOD_CREDIT                 0
dtype: int64

In [14]:
# Read in termination.csv as a dataframe
termination_df = pd.read_csv('Data/termination.csv')

termination_df.head(10)

   INDIVIDUAL_ID ACCT_SUSPD_DATE
0   2.213026e+11      2022-10-09
1   2.213028e+11      2022-04-24
2   2.213027e+11      2022-05-21
3   2.213002e+11      2022-04-27
4   2.213026e+11      2022-09-16
5   2.213026e+11      2022-09-27
6   2.213024e+11      2022-11-23
7   2.213013e+11      2022-10-30
8   2.213024e+11      2022-04-24
9   2.213012e+11      2022-01-21

In [15]:
# Check information for termination_df
termination_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 269259 entries, 0 to 269258
Data columns (total 2 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   INDIVIDUAL_ID    269259 non-null  float64
 1   ACCT_SUSPD_DATE  269259 non-null  object
dtypes: float64(1), object(1)
memory usage: 4.1+ MB

In [19]:
# Dataframe of total rows from each CSV
total_entries = pd.DataFrame(data=[len(address_df), len(customer_df),
                                   len(demographic_df), len(termination_df)],
                             index=['address_df', 'customer_df', 'demographic_df', 'termination_df'],
                             columns=['total_entries'])

total_entries

                total_entries
address_df            1536673
customer_df           2280321
demographic_df        2112579
termination_df         269259

### Observations from initial check
Compared to customer_df, both address_df and demographic_df are incomplete
   * Joining onto customer_df will result in at least 100K rows that are null in key columns
   * Unless a large portion of termination_df has customers that only exist in customer_df then demographic_df might be best choice to merge other dfs on

#### termination_df
termination_df only has entries if the customer churned; use existence of ids here to make 'churned' column.

#### address_df
Depending on if the lats/lon are complete bogus or at least match the city + county, nulls can be filled using that information.

#### customer_df
* Missing id entry particularly puzzling
* AGE_IN_YEARS can be calculated from DOB column; then DOB column is superfluous

#### demographic_df
* HOME_MARKET_VALUE nulls seem to be a result of being a renter; use HOME_OWNER to check
* MARITAL_STATUS is more complicated; 'Unknown' is always possible, but check correlation with other columns to see if there's a potential fill method